# Homebrew Bundle file
# Install with: brew bundle
# Update with: brew bundle --force

# Essential CLI tools
brew "git"
brew "curl"
brew "wget"
brew "tree"
brew "htop"
brew "tmux"
brew "stow"

# Development tools
brew "node"
brew "python@3.11"
brew "go"
brew "rust"

# Text processing and search
brew "ripgrep"
brew "fzf"
brew "jq"
brew "yq"

# Modern CLI replacements
brew "bat"
brew "eza"
brew "fd"
brew "emacs"

# System utilities
brew "gnupg"
brew "openssh"
brew "rsync"

# GUI applications
cask "visual-studio-code"
cask "iterm2"
cask "google-chrome"
